tsung/comments-tsung-file.xml
<?xml version="1.0"?>
<!DOCTYPE tsung
  SYSTEM '/usr/local/share/tsung/tsung-1.0.dtd' []>
<tsung loglevel="notice">
  <clients>
    <client host="localhost" maxusers="15000" use_controller_vm="true"/>
  </clients>
  <servers>
    <server host="" port="80" type="tcp"/>
  </servers>
  <load>
    <arrivalphase duration="5" phase="1" unit="second">
      <users arrivalrate="1" unit="second"/>
    </arrivalphase>
<!--     <arrivalphase duration="15" phase="2" unit="second">
      <users arrivalrate="4" unit="second"/>
    </arrivalphase> -->
  </load>
  <options>
    <option name="global_ack_timeout" value="2000"/>
  </options>
  <sessions>
    <session name="Add Comment" probability="100" type="ts_http">

      <transaction name="Get_Root">
        <request>
          <!-- <match do="abort" when="nomatch">HTTP/1.1 (2|3)\d\d</match> -->
          <http url="/"/>
        </request>
      </transaction>

      <thinktime random="true" value="2"/>

      <transaction name="Get_Register">
        <request>
          <!-- <match do="abort" when="nomatch">HTTP/1.1 (2|3)\d\d</match> -->
          <dyn_variable name="authenticity_token"/>
          <http url="/register"/>
        </request>
      </transaction>

      <setdynvars code="fun({Pid,DynVars})-&gt;{ok,Val}=ts_dynvars:lookup(authenticity_token,DynVars),re:replace(Val,&quot;[+]&quot;,&quot;%2B&quot;,[global, {return,list}]) end." sourcetype="eval">
        <var name="authenticity_token"/>
      </setdynvars>
      <setdynvars length="30" sourcetype="random_string">
        <var name="rnd_email"/>
      </setdynvars>
      <setdynvars length="30" sourcetype="random_string">
        <var name="rnd_user"/>
      </setdynvars>
      <thinktime random="true" value="2"/>

      <transaction name="Post_Register">
        <request subst="true">
          <!-- <match do="abort" when="nomatch">HTTP/1.1 (2|3)\d\d</match> -->
          <http content_type="application/x-www-form-urlencoded" contents="authenticity_token=%%_authenticity_token%%&amp;user%5Bemail%5D=%%_rnd_email%%@gmail.com&amp;user%5Busername%5D=%%_rnd_user%%&amp;user%5Bpassword%5D=123456&amp;user%5Bpassword_confirmation%5D=123456&amp;commit=Sign+up" method="POST" url="/"/>
        </request>
      </transaction>

      <thinktime random="true" value="2"/>

      <transaction name="Redirect_Root">
        <request>
          <!-- <match do="abort" when="nomatch">HTTP/1.1 (2|3)\d\d</match> -->
          <http url="/"/>
        </request>
      </transaction>

<!--       <thinktime random="true" value="2"/>
      <setdynvars end="30" sourcetype="random_number" start="1">
        <var name="random_book_id"/>
      </setdynvars>

      <transaction name="Get_Book">
        <request subst="true">
          <match do="abort" when="nomatch">HTTP/1.1 (2|3)\d\d</match>
          <http url="/books/%%_random_book_id%%"/>
        </request>
      </transaction> -->

      <thinktime random="true" value="2"/>

      <setdynvars end="99" sourcetype="random_number" start="1">
        <var name="random_post_id"/>
      </setdynvars>

      <transaction name="Get_Post">
        <request subst="true">
          <!-- <match do="abort" when="nomatch">HTTP/1.1 (2|3)\d\d</match> -->
          <!-- <dyn_variable name="authenticity_token"/> -->
          <!-- <dyn_variable name="authenticity_token" xpath="string(/html/body/div[2]/div[1]/form/input[2]/@value)"/> -->

          <!-- xpath for authenticty token on input element not working here! -->
          <dyn_variable name="authenticity_token" xpath="/html/head/meta[@name='csrf-token']/@content"/>
          <http url="/posts/%%_random_post_id%%"/>
        </request>
      </transaction>

      <setdynvars code="fun({Pid,DynVars})-&gt;{ok,Val}=ts_dynvars:lookup(authenticity_token,DynVars),re:replace(Val,&quot;[+]&quot;,&quot;%2B&quot;,[global, {return,list}]) end." sourcetype="eval">
        <var name="authenticity_token"/>
      </setdynvars>

      <transaction name="Post_New_Comment_On_Post">
        <request subst="true">
          <!-- <match do="abort" when="nomatch">HTTP/1.1 (2|3)\d\d</match> -->
          <!-- <dyn_variable name="redirect_post_id" re="Location: http://.*/posts/(.*)\r"/> -->
          <dyn_variable name="redirect_post" re="Location: (http://.*)\r"/>
          <http  url="/posts/%%_random_post_id%%/comments" contents="authenticity_token=%%_authenticity_token%%&amp;comment%5Bbody%5D=tsung_parent_comment_body&amp;" method="POST"/>
        </request>
      </transaction>

      <thinktime random="true" value="2"/>

      <transaction name="Redirect_To_Post">
        <request subst="true">
          <!-- <match do="abort" when="nomatch">HTTP/1.1 (2|3)\d\d</match> --><!-- 
          <dyn_variable name="authenticity_token" xpath="string(/html/body/div[2]/div[2]/div[1]/div[2]/form/input[2]/@value)"/> -->
          <dyn_variable name="authenticity_token" xpath="/html/head/meta[@name='csrf-token']/@content"/>
          <dyn_variable name="first_comment_path" xpath="/html/body/div[2]/div[2]/div[1]/div[2]/form/@action"/>
          <http url="/posts/%%_random_post_id%%"/>
        </request>
      </transaction>

      <setdynvars code="fun({Pid,DynVars})-&gt;{ok,Val}=ts_dynvars:lookup(authenticity_token,DynVars),re:replace(Val,&quot;[+]&quot;,&quot;%2B&quot;,[global, {return,list}]) end." sourcetype="eval">
        <var name="authenticity_token"/>
      </setdynvars>
      
      <setdynvars code="fun({Pid,DynVars})-&gt;{ok,Val}=ts_dynvars:lookup(first_comment_path,DynVars),re:replace(Val,&quot;[+]&quot;,&quot;%2B&quot;,[global, {return,list}]) end." sourcetype="eval">
        <var name="first_comment_path"/>
      </setdynvars>

       <thinktime random="true" value="2"/>

      <transaction name="Post_New_Comment_On_Comment">
        <request subst="true">
          <!-- <match do="abort" when="nomatch">HTTP/1.1 (2|3)\d\d</match> -->
          <http url="%%_first_comment_path%%" contents="authenticity_token=%%_authenticity_token%%&amp;comment%5Bbody%5D=tsung_child_comment_body&amp;" method="POST"/>
        </request>
      </transaction>

      <thinktime random="true" value="2"/>

      <transaction name="Redirect_To_Post">
        <request subst="true">
          <!-- <match do="abort" when="nomatch">HTTP/1.1 (2|3)\d\d</match> --><!-- 
          <dyn_variable name="authenticity_token" xpath="string(/html/body/div[2]/div[2]/div[1]/div[2]/form/input[2]/@value)"/> -->
<!--           <dyn_variable name="authenticity_token" xpath="/html/head/meta[@name='csrf-token']/@content"/>
          <dyn_variable name="first_comment_path" xpath="string(/html/body/div[2]/div[1]/form/@action)"/> -->
          <http url="/posts/%%_random_post_id%%"/>
        </request>
      </transaction>
      
    </session>
  </sessions>
</tsung>